---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.Insert(Autodesk.Revit.DB.Electrical.WireSize)
source: html/41b867f8-7571-b593-f73d-fbc8655ac266.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.Insert Method

Insert the specified wire size into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	WireSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireSize`) - The wire size to be inserted into the set.

## Returns
Returns whether the wire size was inserted into the set.